rhoEnergyFoam_v6/tutorials/laminarChannelFlow/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0. 0 0);

boundaryField
{
    side1x
    {
        type            cyclic;
    }

    side2x
    {
        type            cyclic;
    }

   side1z
    {
        type            cyclic;
    }
   side2z
    {
        type            cyclic;
    }

   bottom
    {
        type            noSlip;
    }
    top
    {
        type            noSlip;
    }

}

// ************************************************************************* //
